Repository: Gsdagustavo/projeto_final_flutter
Catalog: lib/l10n/app_*.arb
Languages: pt

# language_pt
source: Portuguese
pt: Português

# language_es
source: Spanish
pt: Español

source: Login
pt: Entrar

source: Password
pt: Senha

source: Forgot your password?
pt: Esqueceu sua senha?

source: Insert your email
pt: Insira seu email

source: Send recovery code
pt: Enviar código de recuperação

source: Register
pt: Registrar

source: Logged in successfully!
pt: Login realizado com sucesso!

source: Account created successfully!
pt: Conta criada com sucesso!

# register_login
source: Would you want to login?
pt: Deseja fazer login?

# recovery_code_sent_to
source: Recovery code sent to {email}
pt: Código de recuperação enviado para {email}

source: Invalid email
pt: Email inválido

source: Invalid password
pt: Senha inválida

source: Account
pt: Conta

source: Account creation
pt: Criação da conta

source: Last sign in
pt: Último login

source: Logout
pt: Sair

# logout_confirmation
source: Do you really want to logout?
pt: Você realmente quer sair?

source: Language
pt: Idioma

# transport_type_car
source: Car
pt: Carro

# transport_type_bike
source: Bike
pt: Bicicleta

# transport_type_bus
source: Bus
pt: Ônibus

# transport_type_plane
source: Plane
pt: Avião

# transport_type_cruise
source: Cruise
pt: Navio de cruzeiro

# travel_stop_type_start
source: Start
pt: Início

# travel_stop_type_stop
source: Stop
pt: Parada

# travel_stop_type_end
source: End
pt: Fim

source: Experience
pt: Experiência

source: Experiences
pt: Experiências

# experience_cultural_immersion
source: Cultural Immersion
pt: Imersão Cultural

# experience_alternative_cuisines
source: Alternative Cuisines
pt: Culinárias Alternativas

# experience_historical_places
source: Visit Historical Places
pt: Visitar Lugares Históricos

# experience_visit_local_establishments
source: Visit Local Establishments (Bars, Restaurants, Parks, etc.)
pt: Visitar Estabelecimentos Locais

# experience_contact_with_nature
source: Contact With Nature
pt: Contato com a Natureza

# experience_social_events
source: Social Events
pt: Eventos sociais

source: Other
pt: Outro

source: Upcoming
pt: Futura

source: Ongoing
pt: Em andamento

source: Finished
pt: Concluída

source: My Travels
pt: Minhas Viagens

source: Start Travel
pt: Iniciar Viagem

# start_travel_confirmation
source: Start Travel {travel}?
pt: Iniciar Viagem {travel}?

source: Travel Started Successfully!
pt: Essa Viagem iniciada com sucesso!

# travel_has_already_started
source: The Travel {travel} has already been started
pt: Essa Viagem já foi iniciada

source: Finish Travel
pt: Finalizar Viagem

# finish_travel_confirmation
source: Finish Travel {travel}?
pt: Finalizar a Viagem?

source: Travel Finished Successfully!
pt: Viagem finalizada com sucesso!

# travel_not_started_yet
source: The Travel {travel} has not started yet
pt: Essa Viagem ainda não começou

source: Delete Travel
pt: Excluir Viagem

# delete_travel_confirmation
source: Do you really want to delete the travel {travel}?
pt: Você realmente deseja excluir a viagem {travel}?

source: Travel Deleted Successfully!
pt: Viagem Excluída com Sucesso!

source: View Travel Route
pt: Ver rota da viagem

# stop
source: {count, plural, =1{{count} Stop} other{{count} Stops}}
pt: {count, plural, =1{{count} parada} other{{count} paradas}}

# title_home
source: Home
pt: Início

# title_register_travel
source: Register Travel
pt: Registrar Viagem

# title_settings
source: Settings
pt: Configurações

# title_map_select_travel_stops
source: Select Travel Stops
pt: Selecionar Paradas

# travel_title_label
source: Travel Title
pt: Título da Viagem

source: Travel Details
pt: Detalhes da viagem

source: Enter travel title...
pt: Insira o título da viagem...

source: Invalid travel title
pt: Título da viagem inválido

# transport_type_label
source: Transport Type
pt: Tipo de Transporte

# experiences_label
source: Experiences
pt: Experiências

# dates_label
source: Dates
pt: Datas

# select_dates_label
source: Select dates
pt: Selecionar datas

source: Start Date
pt: Data de Início da Viagem

source: End Date
pt: Data de Término da Viagem

# err_invalid_date_snackbar
source: You must select a start date first!
pt: Você deve selecionar uma data de início primeiro!

source: Participants
pt: Participantes

# err_invalid_participant_name
source: Invalid participant name
pt: Nome do participante inválido

# err_invalid_participant_age
source: Invalid participant age
pt: Idade do participante inválida

# err_invalid_participant_data
source: Invalid participant data
pt: Dados de participante inválidos

source: No participants on the list
pt: Nenhum participante na lista

source: Add participant
pt: Adicionar participante

source: Update participant
pt: Atualizar participante

source: Name
pt: Nome

source: Age
pt: Idade

source: Participant added!
pt: Participante adicionado!

source: Remove participant
pt: Remover participante

# remove_participant_confirmation
source: Would you really want to remove the participant {participant}?
pt: Você realmente deseja remover o participante {participant}?

# participant_removed
source: Participant {participant} removed successfully!
pt: Participante {participant} removido com sucesso!

source: Participant updated
pt: Participante atualizado

# err_could_not_add_participant
source: Could not add participant
pt: Não foi possível adicionar o participante

# remove_stop
source: Remove Travel Stop
pt: Remover Parada

# stop_added
source: Travel Stop added successfully!
pt: Parada adicionada com sucesso!

# travel_stop_removed
source: Travel Stop removed successfully!
pt: Parada da viagem removida com sucesso!

# err_invalid_leave_date
source: Invalid leave date
pt: Data de saída inválida

# add_stop
source: Add Travel Stop
pt: Adicionar Parada

# remove_stop_confirmation
source: Do you really want to remove this stop?
pt: Remover Parada?

source: Planned Experiences
pt: Experiências Planejadas

# err_register_travel_generic
source: An error occurred while registering the travel
pt: Um erro ocorreu ao registrar a viagem

source: Long press to add stops
pt: Pressione e segure para adicionar paradas

source: Travel Map
pt: Mapa da Viagem

source: Open Map
pt: Abrir Mapa

source: Route Planning
pt: Planejamento de Rota

# route_planning_label
source: Plan your travel route and stops
pt: Planeje sua rota de viagem e paradas

source: Registered Stops
pt: Paradas Registradas

# no_stops_registered
source: No stops registered yet. Use the map to plan your route across different cities and countries
pt: Nenhuma parada registrada ainda. Use o mapa para planejar sua rota entre diferentes cidades e países

# use_the_map_add_waypoints
source: Use the map to modify your route or to add more stops
pt: Use o mapa para modificar sua rota ou adicionar mais paradas

source: Travel Photos
pt: Fotos da Viagem

source: Add Travel Photos
pt: Adicionar Fotos da Viagem

# tap_select_photos
source: Tap to select photos
pt: Toque para selecionar fotos

source: photos selected
pt: fotos selecionadas

source: Choose Photos
pt: Escolher Fotos

# add_photos_label
source: Add photos to make your travel more memorable and visually appealing
pt: Adicione fotos para tornar sua viagem mais memorável e visualmente atraente

source: Invalid Travel Data
pt: A viagem contém dados inválidos

# travel_registered_successfully
source: Your Travel was successfully registered!
pt: Viagem registrada com sucesso

source: Travel Stop
pt: Parada da Viagem

source: Search for places
pt: Procurar lugares

source: Travel Start Location
pt: Local de Início da Viagem

source: Travel End Location
pt: Local de Término da Viagem

source: Register Stop
pt: Registrar Parada

source: Stop registered successfully!
pt: Parada registrada com sucesso!

# err_register_stop
source: An error occurred while trying to register the stop
pt: Ocorreu um erro ao tentar registrar a parada

source: Update Stop
pt: Atualizar Parada

source: Stop updated successfully!
pt: Parada atualizada com sucesso!

source: Arrive Date
pt: Data de Chegada

source: Leave Date
pt: Data de Saída

# err_you_must_select_arrive_date_first
source: You must select the Arrive Date first!
pt: Você deve selecionar a data de chegada primeiro!

source: Finish
pt: Finalizar

source: Duration
pt: Duração

source: days
pt: dias

source: Transport
pt: Transporte

source: Countries
pt: Países

source: Travel Dates
pt: Datas da Viagem

source: Start
pt: Início

source: End
pt: Fim

source: Travel Route
pt: Rota da Viagem

source: Travel title updated
pt: Título da viagem atualizado

source: Travel Title
pt: Título da Viagem

source: Review
pt: Avaliação

source: Reviews
pt: Avaliações

source: Detail Review
pt: Detalhar Avaliação

source: Give a Review
pt: Fazer uma Avaliação

source: Send Review
pt: Enviar Avaliação

source: Add Photo
pt: Adicionar Foto

# no_reviews
source: No reviews yet!
pt: Ainda não há avaliações!

# based_on_reviews
source: {count, plural, =1{Based on 1 review} other{Based on {count} reviews}}
pt: {count, plural, =1{Baseado em 1 avaliação} other{Baseado em {count} avaliações}}

# error_review
source: An error has occurred while registering the review
pt: Ocorreu um erro ao registrar a avaliação

source: Remove review
pt: Remover avaliação

# remove_review_confirmation
source: Do you really want to remove this review?
pt: Você realmente quer remover esta avaliação?

# err_invalid_review_data
source: Invalid review data
pt: Dados da avaliação inválidos

# err_invalid_review_author
source: Invalid review author
pt: Autor da avaliação inválido

# review_registered
source: Review registered successfully!
pt: Avaliação registrada com sucesso!

source: Share your travel
pt: Compartilhe sua viagem

source: Delete Review
pt: Excluir avaliação

# delete_review_confirmation
source: Do you really want to delete this review?
pt: Você realmente deseja excluir esta avaliação?

source: Review Deleted Successfully!
pt: Avaliação excluída com sucesso!

source: Success!
pt: Sucesso!

source: Great!
pt: Ótimo!

source: Error Occurred
pt: Ocorreu um erro

source: Delete
pt: Excluir

# sign_out_question
source: Sign Out?
pt: Sair?

# sign_out_confirmation
source: Are you sure you want to sign out? You'll need to sign in again to access your travels
pt: Tem certeza de que deseja sair? Você precisará entrar novamente para acessar suas viagens

source: Sign Out
pt: Sair

source: Stay Signed In
pt: Manter conectado

# no_internet
source: No Internet Connection
pt: Sem conexão com a internet

# no_internet_message
source: You're currently offline. Some features may not be available until you reconnect to the internet
pt: Você está offline no momento. Alguns recursos podem não estar disponíveis até que você se reconecte à internet

source: Try Again
pt: Tentar novamente

source: Continue Offline
pt: Continuar offline

source: Yes
pt: Sim

source: No
pt: Não

# continue_label
source: Continue
pt: Continuar

source: Add
pt: Adicionar

source: Remove
pt: Remover

source: Warning
pt: Aviso

source: Cancel
pt: Cancelar

source: Error
pt: Erro

source: Unknown error
pt: Erro desconhecido

source: Search
pt: Pesquisar
